In [1]:
#pandas 
import pandas as pd

In [4]:
df=pd.read_csv("air_pollution_data.csv")

In [5]:
df.head()

,city,date,aqi,co,no,no2,o3,so2,pm2_5,pm10,nh3
0,Ahmedabad,30-11-2020,5,520.71,2.38,16.28,130.18,47.68,65.96,72.13,8.36
1,Ahmedabad,01-12-2020,5,1682.28,7.71,54.84,0.73,21.70,120.95,154.53,27.36
2,Ahmedabad,02-12-2020,5,1815.80,16.54,49.35,0.17,23.84,133.47,172.63,28.12
3,Ahmedabad,03-12-2020,5,2296.45,41.57,40.10,0.00,35.76,150.37,202.15,36.48
4,Ahmedabad,04-12-2020,5,2189.64,23.92,58.95,0.02,28.13,160.79,205.80,40.53

In [6]:
df.describe()

,aqi,co,no,no2,o3,so2,pm2_5,pm10,nh3
count,23504.000000,23504.000000,23504.00000,23504.000000,23504.000000,23504.000000,23504.000000,23504.000000,23504.000000
mean,3.920354,1113.224543,6.00554,25.044104,35.059777,15.971449,98.598310,121.848091,12.060212
std,1.415490,1401.770372,24.50272,25.839242,31.901760,23.943464,135.572391,160.429589,17.544759
min,1.000000,173.570000,0.00000,0.310000,0.000000,0.190000,0.500000,0.580000,0.000000
25%,3.000000,447.270000,0.00000,8.740000,7.870000,4.470000,24.677500,32.277500,2.340000
50%,5.000000,700.950000,0.00000,16.450000,28.250000,7.990000,58.860000,75.775000,6.520000
75%,5.000000,1188.280000,0.27000,32.220000,54.360000,16.450000,117.605000,147.642500,15.830000
max,5.000000,23071.290000,457.76000,331.760000,406.270000,442.510000,2203.550000,2429.130000,352.620000

In [8]:
df.isnull().sum()

city     0
date     0
aqi      0
co       0
no       0
no2      0
o3       0
so2      0
pm2_5    0
pm10     0
nh3      0
dtype: int64

In [9]:
df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
23499    False
23500    False
23501    False
23502    False
23503    False
Length: 23504, dtype: bool

In [ ]:
df.groupby('city')['aqi'].mean()

city
Ahmedabad             4.115044
Aizawl                2.783186
Amaravati             3.702434
Amritsar              4.782080
Bengaluru             2.856195
Bhopal                3.919248
Brajrajnagar          4.284292
Chandigarh            4.358407
Chennai               3.768805
Coimbatore            2.799779
Delhi                 4.808628
Ernakulam             2.823009
Gurugram              4.682522
Guwahati              4.096239
Hyderabad             3.809735
Jaipur                4.336283
Jorapokhar            4.806416
Kochi                 2.823009
Kolkata               4.613938
Lucknow               4.698009
Mumbai                4.012168
Patna                 4.756637
Shillong              3.384956
Talcher               4.037611
Thiruvananthapuram    3.195796
Visakhapatnam         3.674779
Name: aqi, dtype: float64

In [11]:
df.groupby('city')['aqi'].sum()

city
Ahmedabad             3720
Aizawl                2516
Amaravati             3347
Amritsar              4323
Bengaluru             2582
Bhopal                3543
Brajrajnagar          3873
Chandigarh            3940
Chennai               3407
Coimbatore            2531
Delhi                 4347
Ernakulam             2552
Gurugram              4233
Guwahati              3703
Hyderabad             3444
Jaipur                3920
Jorapokhar            4345
Kochi                 2552
Kolkata               4171
Lucknow               4247
Mumbai                3627
Patna                 4300
Shillong              3060
Talcher               3650
Thiruvananthapuram    2889
Visakhapatnam         3322
Name: aqi, dtype: int64

In [14]:
import pandas as pd

# Creating a Series
s = pd.Series([10, 20, 30, 40], name="Numbers")
print("Series:\n", s)

# Creating a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'London', 'Tokyo']
}
df = pd.DataFrame(data)
print("\nDataFrame:\n", df)

Series:
 0    10
1    20
2    30
3    40
Name: Numbers, dtype: int64

DataFrame:
       Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Tokyo

In [15]:
f=pd.Series(["Apple","Mango","Grapes","Banana","Orange"],name="Fruits")
print("\nSeries of Fruits:\n",f)

Series of Fruits:
 0     Apple
1     Mango
2    Grapes
3    Banana
4    Orange
Name: Fruits, dtype: object

In [19]:
data={
    'fruit':["apple","Mango","Orange","Watermelon","Banana"],
    'colour':["Red","yellow","Orange","green","Yellow"],
    'Is_sweet':["No","yes","yes","yes","no"]
}
data=pd.DataFrame(data)
df=data.copy()

In [21]:
# Access a column
print(df["fruit"])

# Access the first row using iloc
print(df.iloc[0])

# Access a specific cell (row 0, column 'Color')
print(df.loc[0, "colour"])

0         apple
1         Mango
2        Orange
3    Watermelon
4        Banana
Name: fruit, dtype: object
fruit       apple
colour        Red
Is_sweet       No
Name: 0, dtype: object
Red

In [25]:
#Print only the "Fruit" column.
print(df["fruit"])

#Print the second row (use iloc).
print(df.iloc[1])

#Print the sweetness (Is_Sweet) of the fourth fruit.
print(df.loc[3,"Is_sweet"])

print(df.loc[4,"colour"])

0         apple
1         Mango
2        Orange
3    Watermelon
4        Banana
Name: fruit, dtype: object
fruit        Mango
colour      yellow
Is_sweet       yes
Name: 1, dtype: object
yes
Yellow

In [28]:
# All sweet fruits
print(df[df["Is_sweet"] == True])

# All yellow fruits
print(df[df["colour"] == "Yellow"])

# Fruits that are sweet AND yellow
print(df[(df["Is_sweet"] == True) & (df["colour"] == "Yellow")])

Empty DataFrame
Columns: [fruit, colour, Is_sweet]
Index: []
    fruit  colour Is_sweet
4  Banana  Yellow       no
Empty DataFrame
Columns: [fruit, colour, Is_sweet]
Index: []

In [30]:
df[df["Is_sweet"] == "no"]

    fruit  colour Is_sweet
4  Banana  Yellow       no

In [33]:
df[df['colour']=='red'] | df[df["colour"]=="green"]

   fruit  colour  Is_sweet
3  False   False     False

In [41]:
df[(df["Is_sweet"] == True) & (df["colour"] != "orange")]

Empty DataFrame
Columns: [fruit, colour, Is_sweet]
Index: []

In [43]:
df[df["Is_sweet"] == "no"]

    fruit  colour Is_sweet
4  Banana  Yellow       no

In [46]:
df[(df["Is_sweet"] == False) & (df["colour"] == "yellow")]

Empty DataFrame
Columns: [fruit, colour, Is_sweet]
Index: []

In [47]:
df = pd.DataFrame({
    'Fruit': ["Apple", "Mango", "Orange", "Watermelon", "Banana"],
    'Color': ["Red", "Yellow", "Orange", "Green", "Yellow"],
    'Is_Sweet': [False, True, True, True, False]
})

In [48]:
df["Fruit_Length"]=df["Fruit"].apply(len)

In [49]:
df['Taste']=df['Is_Sweet'].map({True:'Sweet',False:'Not sweet'})

In [50]:
df['Fruit']=df['Fruit'].str.lower()

In [51]:
df

        Fruit   Color  Is_Sweet  Fruit_Length      Taste
0       apple     Red     False             5  Not sweet
1       mango  Yellow      True             5      Sweet
2      orange  Orange      True             6      Sweet
3  watermelon   Green      True            10      Sweet
4      banana  Yellow     False             6  Not sweet